RosimarSilva/UsbReceiverHugo/board/pin_mux.c
    /* PORTB3 (pin 38) is configured as ADC0_SE13 */
    PORT_SetPinMux(BOARD_INITPINS_Analog5_PORT, BOARD_INITPINS_Analog5_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC0 (pin 43) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_Ds2_PORT, BOARD_INITPINS_Ds2_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin 44) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_Ds1_PORT, BOARD_INITPINS_Ds1_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 45) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITPINS_Sw3_PORT, BOARD_INITPINS_Sw3_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC2 (pin 45): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_Sw3_PORT, BOARD_INITPINS_Sw3_PIN, kPORT_InterruptFallingEdge);

    /* PORTC3 (pin 46) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_Sw2_PORT, BOARD_INITPINS_Sw2_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC3 (pin 46): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_Sw2_PORT, BOARD_INITPINS_Sw2_PIN, kPORT_InterruptFallingEdge);

    /* PORTC4 (pin 53) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_PinoTensao1_PORT, BOARD_INITPINS_PinoTensao1_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 54) is configured as PTC5 */
    PORT_SetPinMux(BOARD_INITPINS_PinoTensao2_PORT, BOARD_INITPINS_PinoTensao2_PIN, kPORT_MuxAsGpio);

    /* PORTC7 (pin 56) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITPINS_Led3_PORT, BOARD_INITPINS_Led3_PIN, kPORT_MuxAsGpio);

    /* PORTD0 (pin 57) is configured as PTD0 */
    PORT_SetPinMux(BOARD_INITPINS_Led2_PORT, BOARD_INITPINS_Led2_PIN, kPORT_MuxAsGpio);

    /* PORTD1 (pin 58) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITPINS_Led1_PORT, BOARD_INITPINS_Led1_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 63) is configured as LPUART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_Rx_usb_PORT, BOARD_INITPINS_Rx_usb_PIN, kPORT_MuxAlt3);

    PORTD->PCR[6] = ((PORTD->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable)

                     /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTD7 (pin 64) is configured as LPUART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_Tx_Usb_PORT, BOARD_INITPINS_Tx_Usb_PIN, kPORT_MuxAlt3);

    PORTD->PCR[7] = ((PORTD->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable)

                     /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_SlowSlewRate));

    /* PORTE0 (pin 1) is configured as I2C1_SDA */
    PORT_SetPinMux(BOARD_INITPINS_Sda_PORT, BOARD_INITPINS_Sda_PIN, kPORT_MuxAlt6);

    PORTE->PCR[0] = ((PORTE->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                     | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTE1 (pin 2) is configured as I2C1_SCL */
    PORT_SetPinMux(BOARD_INITPINS_Scl_PORT, BOARD_INITPINS_Scl_PIN, kPORT_MuxAlt6);

    PORTE->PCR[1] = ((PORTE->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                     | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTE22 (pin 11) is configured as ADC0_DP3 */
    PORT_SetPinMux(BOARD_INITPINS_Analog1Dif1_PORT, BOARD_INITPINS_Analog1Dif1_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE23 (pin 12) is configured as ADC0_DM3 */
    PORT_SetPinMux(BOARD_INITPINS_Analog1Dif2_PORT, BOARD_INITPINS_Analog1Dif2_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE29 (pin 17) is configured as PTE29 */
    PORT_SetPinMux(BOARD_INITPINS_Wc_PORT, BOARD_INITPINS_Wc_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[29] = ((PORTE->PCR[29] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTE31 (pin 19) is configured as PTE31 */
    PORT_SetPinMux(BOARD_INITPINS_Usb_on_PORT, BOARD_INITPINS_Usb_on_PIN, kPORT_MuxAsGpio);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_LPUART0TXSRC_MASK | SIM_SOPT5_LPUART0RXSRC_MASK)))

                  /* LPUART0 Transmit Data Source Select: LPUART0_TX pin. */
                  | SIM_SOPT5_LPUART0TXSRC(SOPT5_LPUART0TXSRC_LPUART_TX)

                  /* LPUART0 Receive Data Source Select: LPUART_RX pin. */
                  | SIM_SOPT5_LPUART0RXSRC(SOPT5_LPUART0RXSRC_LPUART_RX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
